//1 начнем с разработки бд
//имеем 3 таблицы: Product/User/PVZ
//далее перезодим к функционалу магазина
//2 при начале работы программы должно быть меню с выбором операции
//сделаем меню с тремя операциями это просмотр товаров, регистрация, авторизация и вывод доступных пвз
//Просмотр товаров - это получение списка товаров из бд тут все проста
//Регистрация - это запрос данных пользователя(у меня будет имя пользователя и пароль два раза), далее проверка
// что аналогичнрго акка нет в бд и проверка на совпадение паролей
//Авторизация - запрашиваем у пользователя пароль и имя пользователя, делаем проверку запросом в бд и все с каййфом
//Вывод доступных пвз аналогичен выводу всех товаров
//после регистрации или авторизации следует личный кабинет, что логично, там у нас будет меню с выбором действия а именно
//корзина, история заказов ну и можно опять добавить вывод всех товаров
//корзина имеет две возможности: купить один товар или все сразу
//история заказов будет иметь сортировку по дате заказа
//пока все



